; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_43)

(:domain logistics)

(:objects
	obj0 obj3 obj8 - airport
	obj1 obj4 obj9 - city
	obj2 obj6 obj7 obj10 obj12 obj13 obj14 - truck
	obj5 obj11 obj15 obj21 obj22 obj23 obj24 obj25 obj27 - package
	obj16 obj17 obj18 obj19 - location
	obj20 obj26 - airplane
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj6 obj3)
	(at obj7 obj3)
	(at obj10 obj8)
	(at obj11 obj0)
	(at obj12 obj8)
	(at obj13 obj0)
	(at obj14 obj8)
	(at obj15 obj0)
	(at obj20 obj8)
	(at obj21 obj0)
	(at obj22 obj8)
	(at obj23 obj3)
	(at obj24 obj8)
	(at obj25 obj8)
	(at obj26 obj8)
	(at obj27 obj0)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj8 obj9)
	(in-city obj16 obj9)
	(in-city obj17 obj4)
	(in-city obj18 obj1)
	(in-city obj19 obj4)
)

(:goal (and
	(at obj5 obj18)
	(at obj11 obj19)
	(at obj15 obj19)
	(at obj21 obj17)
	(at obj22 obj18)
	(at obj23 obj18)
	(at obj24 obj18)
	(at obj25 obj18)
	(at obj27 obj19)
))
)

; plan
1. (drive obj12 obj8 obj16)
   deleted: (at obj12 obj8)
   added: (at obj12 obj16)
   goals met: 0 of 9
2. (drive obj6 obj3 obj17)
   deleted: (at obj6 obj3)
   added: (at obj6 obj17)
   goals met: 0 of 9
3. (drive obj7 obj3 obj17)
   deleted: (at obj7 obj3)
   added: (at obj7 obj17)
   goals met: 0 of 9
4. (fly obj26 obj8 obj0)
   deleted: (at obj26 obj8)
   added: (at obj26 obj0)
   goals met: 0 of 9
5. (load obj20 obj22 obj8)
   deleted: (at obj22 obj8)
   added: (in obj22 obj20)
   goals met: 0 of 9
6. (load obj20 obj24 obj8)
   deleted: (at obj24 obj8)
   added: (in obj24 obj20)
   goals met: 0 of 9
7. (load obj20 obj25 obj8)
   deleted: (at obj25 obj8)
   added: (in obj25 obj20)
   goals met: 0 of 9
8. (fly obj20 obj8 obj3)
   deleted: (at obj20 obj8)
   added: (at obj20 obj3)
   goals met: 0 of 9
9. (drive obj12 obj16 obj8)
   deleted: (at obj12 obj16)
   added: (at obj12 obj8)
   goals met: 0 of 9
10. (drive obj7 obj17 obj19)
   deleted: (at obj7 obj17)
   added: (at obj7 obj19)
   goals met: 0 of 9
11. (load obj20 obj23 obj3)
   deleted: (at obj23 obj3)
   added: (in obj23 obj20)
   goals met: 0 of 9
12. (load obj20 obj5 obj3)
   deleted: (at obj5 obj3)
   added: (in obj5 obj20)
   goals met: 0 of 9
13. (load obj26 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj26)
   goals met: 0 of 9
14. (load obj26 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj26)
   goals met: 0 of 9
15. (load obj26 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj26)
   goals met: 0 of 9
16. (load obj26 obj27 obj0)
   deleted: (at obj27 obj0)
   added: (in obj27 obj26)
   goals met: 0 of 9
17. (fly obj20 obj3 obj0)
   deleted: (at obj20 obj3)
   added: (at obj20 obj0)
   goals met: 0 of 9
18. (fly obj26 obj0 obj3)
   deleted: (at obj26 obj0)
   added: (at obj26 obj3)
   goals met: 0 of 9
19. (drive obj13 obj0 obj18)
   deleted: (at obj13 obj0)
   added: (at obj13 obj18)
   goals met: 0 of 9
20. (drive obj6 obj17 obj3)
   deleted: (at obj6 obj17)
   added: (at obj6 obj3)
   goals met: 0 of 9
21. (drive obj7 obj19 obj3)
   deleted: (at obj7 obj19)
   added: (at obj7 obj3)
   goals met: 0 of 9
22. (unload obj20 obj22 obj0)
   deleted: (in obj22 obj20)
   added: (at obj22 obj0)
   goals met: 0 of 9
23. (unload obj20 obj23 obj0)
   deleted: (in obj23 obj20)
   added: (at obj23 obj0)
   goals met: 0 of 9
24. (unload obj20 obj24 obj0)
   deleted: (in obj24 obj20)
   added: (at obj24 obj0)
   goals met: 0 of 9
25. (unload obj20 obj25 obj0)
   deleted: (in obj25 obj20)
   added: (at obj25 obj0)
   goals met: 0 of 9
26. (unload obj20 obj5 obj0)
   deleted: (in obj5 obj20)
   added: (at obj5 obj0)
   goals met: 0 of 9
27. (unload obj26 obj11 obj3)
   deleted: (in obj11 obj26)
   added: (at obj11 obj3)
   goals met: 0 of 9
28. (unload obj26 obj15 obj3)
   deleted: (in obj15 obj26)
   added: (at obj15 obj3)
   goals met: 0 of 9
29. (unload obj26 obj21 obj3)
   deleted: (in obj21 obj26)
   added: (at obj21 obj3)
   goals met: 0 of 9
30. (unload obj26 obj27 obj3)
   deleted: (in obj27 obj26)
   added: (at obj27 obj3)
   goals met: 0 of 9
31. (fly obj20 obj0 obj8)
   deleted: (at obj20 obj0)
   added: (at obj20 obj8)
   goals met: 0 of 9
32. (fly obj26 obj3 obj8)
   deleted: (at obj26 obj3)
   added: (at obj26 obj8)
   goals met: 0 of 9
33. (drive obj10 obj8 obj16)
   deleted: (at obj10 obj8)
   added: (at obj10 obj16)
   goals met: 0 of 9
34. (drive obj13 obj18 obj0)
   deleted: (at obj13 obj18)
   added: (at obj13 obj0)
   goals met: 0 of 9
35. (fly obj20 obj8 obj3)
   deleted: (at obj20 obj8)
   added: (at obj20 obj3)
   goals met: 0 of 9
36. (fly obj26 obj8 obj0)
   deleted: (at obj26 obj8)
   added: (at obj26 obj0)
   goals met: 0 of 9
37. (load obj2 obj22 obj0)
   deleted: (at obj22 obj0)
   added: (in obj22 obj2)
   goals met: 0 of 9
38. (load obj2 obj23 obj0)
   deleted: (at obj23 obj0)
   added: (in obj23 obj2)
   goals met: 0 of 9
39. (load obj2 obj24 obj0)
   deleted: (at obj24 obj0)
   added: (in obj24 obj2)
   goals met: 0 of 9
40. (load obj2 obj25 obj0)
   deleted: (at obj25 obj0)
   added: (in obj25 obj2)
   goals met: 0 of 9
41. (load obj2 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj2)
   goals met: 0 of 9
42. (load obj6 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj6)
   goals met: 0 of 9
43. (load obj6 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj6)
   goals met: 0 of 9
44. (load obj6 obj27 obj3)
   deleted: (at obj27 obj3)
   added: (in obj27 obj6)
   goals met: 0 of 9
45. (load obj7 obj21 obj3)
   deleted: (at obj21 obj3)
   added: (in obj21 obj7)
   goals met: 0 of 9
46. (drive obj2 obj0 obj18)
   deleted: (at obj2 obj0)
   added: (at obj2 obj18)
   goals met: 0 of 9
47. (drive obj6 obj3 obj19)
   deleted: (at obj6 obj3)
   added: (at obj6 obj19)
   goals met: 0 of 9
48. (drive obj7 obj3 obj17)
   deleted: (at obj7 obj3)
   added: (at obj7 obj17)
   goals met: 0 of 9
49. (drive obj14 obj8 obj16)
   deleted: (at obj14 obj8)
   added: (at obj14 obj16)
   goals met: 0 of 9
50. (fly obj20 obj3 obj0)
   deleted: (at obj20 obj3)
   added: (at obj20 obj0)
   goals met: 0 of 9
51. (unload obj2 obj22 obj18)
   deleted: (in obj22 obj2)
   added: (at obj22 obj18)
   goals met: 1 of 9
52. (unload obj2 obj23 obj18)
   deleted: (in obj23 obj2)
   added: (at obj23 obj18)
   goals met: 2 of 9
53. (unload obj2 obj24 obj18)
   deleted: (in obj24 obj2)
   added: (at obj24 obj18)
   goals met: 3 of 9
54. (unload obj2 obj25 obj18)
   deleted: (in obj25 obj2)
   added: (at obj25 obj18)
   goals met: 4 of 9
55. (unload obj2 obj5 obj18)
   deleted: (in obj5 obj2)
   added: (at obj5 obj18)
   goals met: 5 of 9
56. (unload obj6 obj11 obj19)
   deleted: (in obj11 obj6)
   added: (at obj11 obj19)
   goals met: 6 of 9
57. (unload obj6 obj15 obj19)
   deleted: (in obj15 obj6)
   added: (at obj15 obj19)
   goals met: 7 of 9
58. (unload obj6 obj27 obj19)
   deleted: (in obj27 obj6)
   added: (at obj27 obj19)
   goals met: 8 of 9
59. (unload obj7 obj21 obj17)
   deleted: (in obj21 obj7)
   added: (at obj21 obj17)
   goals met: 9 of 9
